АлогистикТест2/src/Documents/алк_ВходящийТранспорт/алк_ВходящийТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВходящийТранспорт</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиНесортированного</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВагона</name>
    <comment>Номер вагона/автомобиля</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВагонаВРег</name>
    <comment>Номер вагона/автомобиля</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладнойВрег</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РазгрузкаСобственнымиСилами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ВходящийТранспорт/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре"; 
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);			
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Движения.алк_ОстаткиНесортированного.Очистить();
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.алк_ВходящийТранспорт.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	РфпСервер.ОтразитьОстаткиНесортированного(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ);
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	НомерНакладнойВрег = Врег(СтрЗаменить(НомерНакладной, " ", "")); 
	НомерВагонаВРег = Врег(СтрЗаменить(НомерВагона, " ", "")); 	
	
	Если Дата >= Дата(2022,5,12) И Не ЗначениеЗаполнено(Ссылка) тогда
		Сообщить("В программе не требуется вводить документ входящий транспорт. Для отражения факта прибытия и разгрузки транспортных средств используйте документ входящая отгрузка.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры
